/************************************************
文件：buzz.c
用途：
注意：内部8M晶振
创建：2008.4.1
修改：2008.4.1
Copy Right  (c)  www.avrvi.com  AVR与虚拟仪器
************************************************/
#include "..\config.h"
/*************************************************************************
** 函数名称:蜂鸣器初始化
** 功能描述:
** 输　入:
** 输出	 :
** 全局变量:
** 调用模块:
** 说明：
** 注意：
**************************************************************************/
void Buzz_init(void)
{
 BUZZ_DDR |= (1<<SPK);
 BUZZ_PORT &=~ (1<<SPK);
}
/*************************************************************************
** 函数名称:蜂鸣
** 功能描述:
** 输　入: H_time: 响的时间 L_time: 不响的时间
** 输出	 :
** 全局变量:
** 调用模块:
** 说明：
** 注意：
**************************************************************************/
void Beep(unsigned int H_time,unsigned int L_time)
{
 BUZZ_PORT |= (1<<SPK);
 delay_nms(H_time);
 BUZZ_PORT &=~ (1<<SPK);
 delay_nms(L_time);
}